---
kind: method
id: M:Autodesk.Revit.DB.DimensionSegmentArray.#ctor
source: html/88956162-469e-7ed3-da2a-8c933e3b0138.htm
---
# Autodesk.Revit.DB.DimensionSegmentArray.#ctor Method

Initializes a new instance of the DimensionSegmentArray class

## Syntax (C#)
```csharp
public DimensionSegmentArray()
```